# To execute - `brew bundle install`

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Standard apps
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'grandperspective'
cask 'google-chrome'
cask 'iina'
cask 'iterm2'
cask 'istat-menus'
cask 'karabiner-elements'
cask 'keyboard-maestro'
cask 'macmediakeyforwarder'
cask 'slack'
cask 'spotify'
cask 'sublime-text'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-csv'

# Fonts
cask 'font-fontawesome'
cask 'font-hack'
cask 'font-lato'
cask 'font-nunito-sans'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
# brew 'mas'
# mas 'Xcode', id: 497799835

# Development
# brew 'aws-elasticbeanstalk'
# brew 'awscli'
# brew 'bash'
# brew 'imagemagick', link: false
# brew 'imagemagick@6', link: true
# brew 'libxml2'
# brew 'postgresql', restart_service: true
# brew 'postgresql@11'
# brew 'rbenv'
# brew 'redis', restart_service: true
# brew 'v8@3.15', link: true
# brew 'vim'
# brew 'yarn'
# brew 'yaz'
# brew 'heroku/brew/heroku'
